general/video/we_steal_secrets.html
---
title: "We Steal Secrets"
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>We Steal Secrets</title>
<!-- 2016-11-13 周日 14:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>





</head>
<body>
<div id="content">
<h1 class="title">We Steal Secrets</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Timeline</a></li>
<li><a href="#sec-2">2. Quote</a></li>
<li><a href="#sec-3">3. Link</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Timeline</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">1987/00/00</th>
<th scope="col" class="left">Julian Assange began hacking with a group called the International Subversives</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">1989/10/18</td>
<td class="left">Spacecraft Atlantis/Galileo was launched, worm WANK was detected on NASA's network</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">2006/10/04</td>
<td class="left">Wikileaks's domain name was registered</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>2009</b></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">2009/07/31</td>
<td class="left">Wikileaks leaked confidential documents from Icelandic bank Kaupthing</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">2009/10/00</td>
<td class="left">Bradley Manning was deployed to Forward Operating Base Hammer near Baghdad</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">2009/11/25</td>
<td class="left">Wikileaks leaked 911 pager messages</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>2010</b></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">2010/04/05</td>
<td class="left">Wikileaks leaked video of 2007 Baghdad airstrike</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">2010/05/21</td>
<td class="left">Bradley Manning contacted Adrian Lamo, and admitted leaking classified material to Julian Assange</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">2010/05/25</td>
<td class="left">Adrian Lamo gave the chat logs to FBI, leading to Bradley Manning being arrested in Iraq</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">2010/07/25</td>
<td class="left">Wikileaks and media partners published 91,000 documents on the Afghanistan War</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">2010/08/20</td>
<td class="left">Swedish police investigated Assange for rape and molestation</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">2010/10/22</td>
<td class="left">Wikileaks released 400,000 documents relating to the Iraq War</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">2010/11/28</td>
<td class="left">Wikileaks and 5 newspapers started publishing 251,287 leaked diplomatic cables</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">2010/12/02</td>
<td class="left">Interpol issued demand for Assange's arrest</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">2010/12/07</td>
<td class="left">Assange surrendered to police in London</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">2010/12/08</td>
<td class="left">Anonymous hackers attacked PayPal, Visa and MasterCard sites to avenge Assange</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">2010/12/17</td>
<td class="left">Tunisian Revolution, Arab Spring began</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>2012</b></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">2012/08/16</td>
<td class="left">Assange was granted political asylum by Ecuador</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Quote</h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
The Internet is not a good place for secrets. Cyberspace is like a galaxy of passageways, constantly moving streams of data. With a simple computer, anyone can enter and explore. That's what Julian Assange liked to do, explore. He liked to use trap doors to enter where he wasn't supposed to go, to find secrets and expose them. He built a machine for leaking secrets and called it "WikiLeaks." The website boasted an electronic drop box that could receive secrets sent by people who didn't want to reveal who they were. Once WikiLeaks had the secrets, it would publish them across servers, domain names, and networks hso numerous that the information could never be taken down.
</p>
</blockquote>

<blockquote>
<p>
9/11 turned out to be a watershed moment for the world of secrets, both for the leakers and the secret keepers. In the years after 9/11, facing enemies it didn't understand, the U.S. government started sharing more information between different agencies. At the same time, the U.S. also started to keep more secrets from its citizens. In data centers that sprang up all over the country, the U.S. launched a massive expansion of its operations to gather secrets. The amount of classified documents per year increased from 8 million to 76 million. The number of people with access to classified information soared to more than 4 million. And the government began to intercept phone calls and emails at a rate of 60,000 per second. Nobody knows how much money is involved, it's a secret. Not even Congress knows the entire budget.
</p>
</blockquote>

<hr  />

<blockquote>
<p>
Julian's a computer hacker. He comes from that ideology that all information is good, and everything should be published. I asked Julian if he would publish information sent to his website that could lead to the deaths of innocents, such as how to release anthrax into a town's water supply. "Yes. Even if there is a possibility it would lead to loss of life." This is a man whose primary way of interacting with the world is a digital one. It is to some degree unsullied by the limitations of human nature. He does sometimes reduce human activity to something formulaic, and he doesn't see the human heart beating in there. He just reduced it to that very, very simple formula.
</p>
</blockquote>

<hr  />

<blockquote>
<p>
Items of historical significance for two wars. Iraq and Afghanistan. This is possibly one of the more significant documents of our time. Removing the fog of war and revealing the true nature of 21st century asymmetrical warfare.
</p>
</blockquote>

<blockquote>
<p>
"They were stored on a centralized server. I would come in with music on a CD-RW labeled with something like 'Lady Gaga', erase the music, then write a compressed split file. No-one suspected a thing. &#x2026; listened to lip-synced Lady Gaga's Telephone while exfiltrating possibly the largest data spillage in American history." Manning turned his computers into efficient exfiltration machines. Over several months, Manning made over 794,000 connections with the State Department's server. He downloaded hundreds of thousands of documents without anyone noticing. When he hit a snag, he reached out to another hacker for advice on how to crack passwords. Later, Manning talked to him about the progress of the uploads.
</p>
</blockquote>

<hr  />

<blockquote>
<p>
There is a phenomenon called Noble Cause Corruption. Essentially, you do things which if anyone else did you would recognize aren't okay, aren't right. But because you know you're a good guy, it's different for you. I suppose you can't accuse Julian of not setting out from the beginning what he may do. Mendax by name, Mendax by nature. The same extraordinary personality which conceived of and created WikiLeaks is also the same personality that has effectively destroyed WikiLeaks.
</p>

<p>
WikiLeaks has become what it detests and what it actually tried to rid the world of. We must get away from this understanding that we see Julian as a savior, that's going to change all of it. The credit is undue. Everybody celebrating Julian as a whistle-blower. He's not. Bradley Manning might have been a whistle-blower, and, if he was, he is the courageous guy. He is the one that took all the risk and in the end now is suffering.
</p>
</blockquote>

<hr  />

<blockquote>
<p>
Whistle-blowing is a really isolating act. It's a courageous and phenomenal thing to do, but you are essentially doing something that your colleagues and your friends would not want you to do and not understand. It alienates you further from them. A source who needs to talk to someone and explain what they've done and think through what they've done needs someone safe to do that to. In the logs, Manning says, he couldn't talk to WikiLeaks, that's not how they work. Does that protect whistle-blowers or does it protect WikiLeaks?
</p>

<p>
In the end, everybody's just human. If you're leaking material to someone, something that really makes a difference, then just from a human perspective, it's really difficult not to get any credit for it. Because no one can tap you on the shoulder and say, "Good job. Courageous thing you did." And this is really the complicated part about it. How do you make sure that your source doesn't compromise themselves?
</p>
</blockquote>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Link</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="https://en.wikipedia.org/wiki/WANK_(computer_worm)">WANK</a>
</li>
<li><a href="https://collateralmurder.wikileaks.org/">Collateral Murder</a>
</li>
<li><a href="https://911.wikileaks.org/">9/11 Tragedy Pager Intercepts</a>
</li>
<li><a href="https://wardiary.wikileaks.org/">War Diaries</a>
</li>
<li><a href="https://wikileaks.org/plusd/">Public Library of US Diplomacy</a>
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-11-13 周日 14:57</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
